newwms_gift/src/Catalogs/ВидыДополнительныхРабот/ВидыДополнительныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДополнительныхРабот</name>
  <attributes>
    <name>ШаблонКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыШаблона</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

newwms_gift/src/Catalogs/ВидыДополнительныхРабот/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ПараметрыШаблонаТипЗначения.СписокВыбора.Добавить("Строка");
	Элементы.ПараметрыШаблонаТипЗначения.СписокВыбора.Добавить("Число");
	Элементы.ПараметрыШаблонаТипЗначения.СписокВыбора.Добавить("Булево");
	Элементы.ПараметрыШаблонаТипЗначения.СписокВыбора.Добавить("Дата");
КонецПроцедуры

&НаСервере
Процедура СтраницыПриСменеСтраницыНаСервереФормула()
	СписокПараметров.Очистить();
	Для Каждого стр из Объект.ПараметрыШаблона Цикл
		Если стр.ТипЗначения="Число" Тогда 
			СписокПараметров.Добавить(стр.ИмяПараметра);
		КонецЕсли;
	КонецЦикла;
	СписокПараметров.Добавить("*");
	СписокПараметров.Добавить("+");
	СписокПараметров.Добавить("-");
	СписокПараметров.Добавить("/");

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя="Формула" Тогда 
	СтраницыПриСменеСтраницыНаСервереФормула();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокПараметровВыборНаСервере(Значение)
	Объект.ФормулаШаблона=Объект.ФормулаШаблона+Значение;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Значение=ТекущийЭлемент.ТекущиеДанные.Значение;
	СписокПараметровВыборНаСервере(Значение);
КонецПроцедуры
